{
  "main": {
    "name":"Praveen Patil",
    "occupation":"Software Developer",
    "description":"This is my website",
    "image":"Praveen1.jpg",
    "bio":"I am a Master's Student in Computer Science at University of Southern California. I worked as a Software Developer at Cisco Systems,Inc. for 2.5 years gaining vast professional experience in Software Development. I completed my undergraduate studies majoring in computer science from M S Ramaiah Institute of Technology,Bangalore. I worked as a Software Engineering intern at Cisco and Research intern at IBM. I work on technologies like Java, Python, React, ML, C and likewise. I aspire to become a full stack developer with a concentration on Software Development and Machine Learning. I am looking forward to seeking a platform for the same.",
    "contactmessage":"Please feel free to reach out to me by shooting email below",
    "email": "prvnsp9@gmail.com",
    "phone": "+1 213-421-5418",
    "address":{
      "street":"1210. West Adams Blvd",
      "city":"Los Angeles,",
      "state":"California, USA",
      "zip": "90007"
    },
    "resumedownload":"https://bit.ly/2Xm9WqE",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/praveensp.patil",
        "className":"fa fa-facebook"
      },
      {
        "name":"twitter",
        "url":"https://twitter.com/prvnsp9",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/praveenpatil09/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/Praveensp9/",
        "className":"fa fa-github"
      },
      {
        "name":"skype",
        "url":"skype:live:prvnsp9_1?chat",
        "className":"fa fa-skype"
      }
    ]
  },
  "resume":{
    "skillmessage":"Avid Software Developer, ML/AI enthusiast and a passionate coder. I am good at coding in Java,Python,Javascript. I have knowledge on working with TensorFlow, MongoDB, Elasticsearch, SQL, Cassandra databases. I have hosted applications on AWS and GCP during Hackthons, Projects and have experience on working with android development.",
    "education":[
      {
        "school":"University of Southern California",
        "degree":"Masters in Computer Science (Data Science)",
        "graduated":"December 2020",
        "description":"I am currently pursuing Master's in Computer Science at University of Southern California. I have taken courses on Data Strctures and Advanced algorithms (CSCI-570), Database Systems (CSCI-585), Machine Learning (INF-552), Web Technologies (CSCI 571), Operating Systems (CSCI 402) and Applied Natural Language Processing (CSCI 544).I am passionate about coding, data structures and algorithms. I love coding and use Leetcode and Hackerrank to code using Java. I have participated in hackthons organised by CalTech, USC(winner), UCLA. I am currently working as a Machine Learning Research Assistant at CiSoft Lab,USC. Also, I work as a Research Assistant under Professor, Morteza Dehghani working on a NLP Project called Neural Text Analysis Pipeline (NTAP)."
      },
      {
        "school":"M S Ramaiah Institute of Technology",
        "degree":"Computer Science",
        "graduated":"June 2016",
        "description":"I am a B.E graduate from M S Ramaiah Institute of Technology, Bangalore majoring in Computer Science. Graduated in Fall 2016. As part of the curriculum, I have taken courses focused on Compiler Design, Python, Data Structures, algorithms, Java and many more. I also participated in many Hackthons along with academics. I was winner of HP Thinkthon and IBM Hackthon. An active participant on coding platforms like codechef, HackerEarth, HackerRank. I worked at Cisco, Bangalore during my final semester as a Software Engineering Intern."
      }
    ],
    "work":[
      {
        "company":"CiSoft Lab - Information Science Institute",
        "title":"Machine Learning Research Assistant",
        "years":"May 2019 - Present",
        "href":"https://cisoft.usc.edu",
        "description":"Developing and implementing Machine Learning algorithms to solve the real time oil well failures of Chevron under Prof. Raghu Raghavendra and Prof. Ke-Thia Yao at ISI USC. Working with Java and Python for implementing machine learning algorithms. Weka is used for data mining and visualization of the oil well data from Chevron. "
      },
      {
        "company":"Computational Social Science Lab - USC",
        "title":"Research Assistant",
        "years":"January 2019 - Present",
        "href":"https://dornsife.usc.edu/labs/cssl",
        "description":"As a Research Assistant at CSSL working under Prof. Morteza Dehghani, I work on the problem of Neural Text Analysis Pipeline (NTAP). We Implement NLP tools that does crawling, clustering, classify using Naïve Bayes and SVM. I also have involved myself in the developement of Eclipse based Java crawler called TACIT. Deployed it on MacOS, Windows and Linux operating systems using Jenkins and Tycho plugin. This uses MongoDb as backend database."
      },
      {
        "company":"Cisco Systems,Inc.",
        "title":"Software Developer II ",
        "years":"April 2018 - December 2018",
        "href" : "https://www.cisco.com/c/en/us/products/security/identity-services-engine/index.html",
        "description":"I worked on product ISE at Cisco. I focused in designing and developing IPV6 SNMP support Cisco ISE 2.5 release using C and python. Also,i was an integral part of Cisco ISE Pxgrid and MDM Services development team. I received many accolades including multiple connected recognition from manager and team for excellent quality deliverables."
      },
      {
        "company":"Cisco Systems,Inc.",
        "title":"Software Developer I",
        "years":"August 2016 - March 2018",
        "href" :"https://www.cisco.com/c/en/us/products/security/identity-services-engine/index.html",
        "description":"I started my carrier as Software Developer at Cisco.I was working as developer for Licensing team in ISE 2.2. Also, I Developed front end for ISE Readiness Assessment project using Node.js and Bootstrap. Contributed effectively in development of Licensing feature for ISE Denali (2.2) Release. Proposed and designed use of Elasticsearch and Kibana for storage and data analysis of ISE Readiness customer."
      },
      {
        "company":"Cisco Systems,Inc.",
        "title":"Data Analytics Intern",
        "years":"January 2016 - June 2016",
        "href":"#",
        "description":"As a software engineer intern at Cisco Systems, i started working on a data analytics project called 'Diff Set Based Automation'. The project was successful and won the 'Continuos Integration Innovation Challenge Award' organised by Cisco during May 2016. The project was developed using Linux platform and the storage mechanism used for the project is 'MongoDb'. The key technologies used for the project are Python, Java and data analytics algorithms. "
      },
      {
        "company":"IBM,India.",
        "title":"Cloud Research Intern",
        "years":"May 2015 - August 2015",
        "href":"#",
        "description":"During my tenure as a cloud research intern at IBM, i worked on various IBM cloud technologies like IBM Watson, Bluemix. Also, designed a cloud application which analyses patient records of hospital using IBM Watson, Bluemix platform and python as the programming language."
      }
    ],
    "skills":[
      {
        "name":"Machine Learning",
        "level":"70%"
      },
      {
        "name":"C++",
        "level":"80%"
      },
      {
        "name":"Python",
        "level":"90%"
      },
      {
        "name":"Git",
        "level":"90%"
      },
      {
        "name":"ReactJs",
        "level":"80%"
      },
      {
        "name":"CSS",
        "level":"80%"
      },
      {
        "name":"HTML5",
        "level":"80%"
      },
      {
        "name":"Java",
        "level":"90%"
      },
      {
        "name":"MongoDB",
        "level":"90%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Resume Website",
        "category":"A React based resume website template",
        "image":"Resume.jpg",
        "url":"https://www.praveen9.com/"
      },
      {
        "title":"WebApp for college lab exams",
        "category":"A Javascript and PHP based web application",
        "image":"WebApp.jpg",
        "url":"https://github.com/Praveensp9/WebApp-for-college-lab-exams"
      },
      {
        "title":"Twitter data sentimental analysis",
        "category":"A tool that performs sentimental analysis on people tweets using twitter api's",
        "image":"Twitter_Analysis.jpg",
        "url":"https://github.com/Praveensp9/Twitter-sentimental-analysis"
      },
      {
        "title":"Musically Connected",
        "category":"A platform where musicians can collaborate and form a community instantly",
        "image":"lahacks.jpg",
        "url":"https://devpost.com/software/musically-connected"
      },
      {
        "title":"Travel Companion",
        "category":"A Blockstack project using BlockChain",
        "image":"blockstack.jpg",
        "url":"https://devpost.com/software/travel-companion-ilh31d"
      },
      {
        "title":"TACIT",
        "category":"Text Analysis,Crawling and Interpretation Tool",
        "image":"tacit.jpg",
        "url":"http://tacit.usc.edu"
      }
    ]
  }
}
